tugas 9/benchmark_async/test_result_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      10
Time taken for tests:   2.844 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    351.65 [#/sec] (mean)
Time per request:       28.437 [ms] (mean)
Time per request:       2.844 [ms] (mean, across all concurrent requests)
Transfer rate:          41.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:    13   28   7.8     25      79
Waiting:       13   28   7.8     25      79
Total:         16   28   7.9     25      79

Percentage of the requests served within a certain time (ms)
  50%     25
  66%     27
  75%     29
  80%     31
  90%     37
  95%     42
  98%     55
  99%     70
 100%     79 (longest request)