tugas 9/benchmark_async/test_result_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      100
Time taken for tests:   3.012 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    332.01 [#/sec] (mean)
Time per request:       301.194 [ms] (mean)
Time per request:       3.012 [ms] (mean, across all concurrent requests)
Transfer rate:          39.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   4.1      0      19
Processing:     6  287  99.5    274     578
Waiting:        6  287  99.4    274     578
Total:         26  289  97.1    274     579

Percentage of the requests served within a certain time (ms)
  50%    274
  66%    281
  75%    289
  80%    299
  90%    440
  95%    526
  98%    566
  99%    575
 100%    579 (longest request)