tugas 9/benchmark_async/test_result_15.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      15
Time taken for tests:   3.016 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    331.54 [#/sec] (mean)
Time per request:       45.244 [ms] (mean)
Time per request:       3.016 [ms] (mean, across all concurrent requests)
Transfer rate:          39.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       4
Processing:     3   45  15.4     39     121
Waiting:        3   45  15.3     39     121
Total:          6   45  15.3     39     121

Percentage of the requests served within a certain time (ms)
  50%     39
  66%     45
  75%     50
  80%     52
  90%     60
  95%     66
  98%    112
  99%    118
 100%    121 (longest request)