tugas 9/benchmark_async/test_result_200.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      200
Time taken for tests:   0.855 seconds
Complete requests:      1000
Failed requests:        167
   (Connect: 0, Receive: 0, Length: 167, Exceptions: 0)
Non-2xx responses:      167
Total transferred:      20374 bytes
HTML transferred:       668 bytes
Requests per second:    1170.08 [#/sec] (mean)
Time per request:       170.928 [ms] (mean)
Time per request:       0.855 [ms] (mean, across all concurrent requests)
Transfer rate:          23.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  10.3      8      46
Processing:     1   65 153.8      7     799
Waiting:        0   59 156.1      0     799
Total:          3   76 160.0     17     817

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     19
  75%     20
  80%     22
  90%    349
  95%    465
  98%    636
  99%    798
 100%    817 (longest request)