tugas 9/benchmark_async/test_result_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      50
Time taken for tests:   2.946 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    339.41 [#/sec] (mean)
Time per request:       147.316 [ms] (mean)
Time per request:       2.946 [ms] (mean, across all concurrent requests)
Transfer rate:          40.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       8
Processing:     8  143  50.2    136     348
Waiting:        7  143  50.2    136     347
Total:         16  143  49.8    136     348

Percentage of the requests served within a certain time (ms)
  50%    136
  66%    141
  75%    142
  80%    144
  90%    160
  95%    307
  98%    345
  99%    346
 100%    348 (longest request)