tugas 9/benchmark_async/test_result_500.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            45000

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      500
Time taken for tests:   0.817 seconds
Complete requests:      1000
Failed requests:        226
   (Connect: 0, Receive: 0, Length: 226, Exceptions: 0)
Non-2xx responses:      226
Total transferred:      27572 bytes
HTML transferred:       904 bytes
Requests per second:    1223.29 [#/sec] (mean)
Time per request:       408.733 [ms] (mean)
Time per request:       0.817 [ms] (mean, across all concurrent requests)
Transfer rate:          32.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   61  27.9     57     124
Processing:     7  108 159.3     43     672
Waiting:        0   80 170.5      0     672
Total:         23  169 174.3     99     724

Percentage of the requests served within a certain time (ms)
  50%     99
  66%    102
  75%    107
  80%    246
  90%    448
  95%    623
  98%    702
  99%    714
 100%    724 (longest request)